app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
    def index
      # flash[:notice] = params

      @all_ratings = Movie.all_ratings
      @selected_ratings = params[:ratings].blank? ? Movie.all_ratings.to_h { |r| [r, true] } : params[:ratings].map { |r, v| [r, v == "1"] }.to_h